artillery.yml
config:
  ensure:
    p99: 50
  target: "http://localhost:8010"
  phases:
    - duration: 30
      arrivalRate: 100
scenarios:
  - flow:
      - post:
          url: "/rides"
          json:
            start_lat: 81.024
            start_long: 112.045
            end_lat: 83.5987742
            end_long: -124.221
            rider_name: "Jason Statment"
            driver_name: "Michel Angelo"
            driver_vehicle: "Marcedes"
          capture:
            json: "$[0].rideID"
            as: "id"
      - get:
          url: "/rides/{{ id }}"
      - get:
          url: "/rides"